#pragma once
#include <string>
#include <vector>
#include <cstdlib>

namespace motomoto {

	class meme
	{
	public:

		meme(int index = 0, bool custom_meme = false);
		~meme();

		std::string get_meme();

		bool gen_meme(int index = 0, bool custom_meme = false);

	private:
		std::string meme_text;

		std::vector<std::string> memes = { "(͡° ͜ʖ ͡°)", "(͡° ͜ʖ ͡°)╭∩╮", "(•)(•)ԅ(≖⌣≖ԅ)", "(‿!‿) ԅ(≖‿≖ԅ)", "•́ε•̀٥", "(͠≖ ͜ʖ͠≖)ε｀●)", "(ㅅ)", "° ͜ʖ ͡ –",
							"ᕤ(͡~͜ʖ ͡°)", "(͠° ͟ʖ ͡°)", "(͡~͜ʖ ͡°)", "(° ͜ʖ °)", "(͡ᵔ ͜ʖ ͡ᵔ)", "(╯ ͠° ͟ʖ ͡°)╯┻━┻", "｡* ﾟ.*.｡(っ ᐛ)っ✂╰⋃╯", "(͡ʘ ͜ʖ ͡ʘ)",
							"(͡o ͜ʖ ͡o)", "(ಠ ͜ʖಠ)", "(ง ͡ʘ ͜ʖ ͡ʘ)ง", "(ง ͠° ͟ل͜ ͡°)ง", "(͠≖ ͜ʖ͠≖)", "(͡° ʖ̯ ͡°)", "(ᴗ ͜ʖ ᴗ)", "(‡▼益▼)", "(‡ಠ╭╮ಠ)",
							"(｀∀´)Ψ", "¯\_(͡° ͜ʖ ͡°)_ / ¯", "¯\_(ツ)_ / ¯", "(✧≖ ͜ʖ≖)", "(✿❦ ͜ʖ ❦)", "(͡ ͡° ͜つ ͡͡°)", "(☞ ͡° ͜ʖ ͡°)☞",
							"ᕦ(͡° ͜ʖ ͡°)ᕤ", "٩(^ ᴗ^)۶", "ᕕ(͡° ͜ʖ ͡°)ᕗ", "(☝◞‸◟)☞", "ᕕ(ᐛ)ᕗ", "ᕕ(ཀ ʖ̯ ཀ)ᕗ", "ᕙ(▀̿̿Ĺ̯̿̿▀̿ ̿) ᕗ", "ლ(´ڡ`ლ)",
							"(╬ಠ益ಠ)", "(ó﹏ò｡)", "(´･_･`)", "凸(•̀_•́)凸", "(‾ ʖ̫ ‾)", "✌. | •͡˘‿•͡˘ | .✌", "(͠≖ ͜ʖ͠≖)", "(͡° ʖ̯ ͡°)",
							"ʕ ͡° ʖ̯ ͡°ʔ", "┌П┐(►˛◄’!)", "ヽ(ﾟДﾟ)ﾉ", "┬┴┤(͡⚆ل͜├┬┴┬", "ཀ ʖ̯ ཀ", "ಠ╭╮ಠ", "(ᗒᗣᗕ)՞", "ಥ_ಥ", "凸༼ຈل͜ຈ༽凸",
							"ɿ(｡･ɜ･)ɾⓌⓗⓨ ?", "ɿ(｡･ɜ･)ɾⓌⓗⓐⓣ？", "щ（ﾟДﾟщ） < Dear god why‽ )", "» - (¯`·.·´¯)->Text < -(¯`·.·´¯) - «",
							"(｢๑•₃•)｢ ʷʱʸ ?", "◕‿↼", "(͡°(͡° ͜ʖ(͡° ͜ʖ ͡°)ʖ ͡°) ͡°)", "kanker!", "motomoto", "LOL", "shrek", "da fack?",
							"fffffffffffffffffffffffff", "ik wil dood", "nee, hij was nsb'er"};
	};
}

